<details><summary>Digger run report at 2023-10-10 12:22:04 (UTC)</summary>
    <details><summary>Apply for <b>rimvydascivilis/app-infra#live_staging_eks</b></summary>
  
```terraform
Terraform will perform the following actions:

  # data.aws_eks_addon_version.this["coredns"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "coredns"
      + id                 = (known after apply)
      + kubernetes_version = "1.28"
      + most_recent        = true
      + version            = (known after apply)
    }

  # data.aws_eks_addon_version.this["kube-proxy"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "kube-proxy"
      + id                 = (known after apply)
      + kubernetes_version = "1.28"
      + most_recent        = true
      + version            = (known after apply)
    }

  # data.aws_eks_addon_version.this["vpc-cni"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "vpc-cni"
      + id                 = (known after apply)
      + kubernetes_version = "1.28"
      + most_recent        = true
      + version            = (known after apply)
    }

  # data.tls_certificate.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "this" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # aws_cloudwatch_log_group.this[0] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/eks/eks-staging/cluster"
      + name_prefix       = (known after apply)
      + retention_in_days = 90
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "staging"
          + "Name"        = "/aws/eks/eks-staging/cluster"
          + "Terraform"   = "true"
        }
      + tags_all          = {
          + "Environment" = "staging"
          + "Name"        = "/aws/eks/eks-staging/cluster"
          + "Terraform"   = "true"
        }
    }

  # aws_ec2_tag.cluster_primary_security_group["Environment"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "Environment"
      + resource_id = (known after apply)
      + value       = "staging"
    }

  # aws_ec2_tag.cluster_primary_security_group["Terraform"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "Terraform"
      + resource_id = (known after apply)
      + value       = "true"
    }

  # aws_eks_addon.this["coredns"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name           = "coredns"
      + addon_version        = (known after apply)
      + arn                  = (known after apply)
      + cluster_name         = "eks-staging"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + resolve_conflicts    = "OVERWRITE"
      + tags                 = {
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + tags_all             = {
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }

      + timeouts {}
    }

  # aws_eks_addon.this["kube-proxy"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name           = "kube-proxy"
      + addon_version        = (known after apply)
      + arn                  = (known after apply)
      + cluster_name         = "eks-staging"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + resolve_conflicts    = "OVERWRITE"
      + tags                 = {
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + tags_all             = {
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }

      + timeouts {}
    }

  # aws_eks_addon.this["vpc-cni"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name           = "vpc-cni"
      + addon_version        = (known after apply)
      + arn                  = (known after apply)
      + cluster_name         = "eks-staging"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + resolve_conflicts    = "OVERWRITE"
      + tags                 = {
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + tags_all             = {
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }

      + timeouts {}
    }

  # aws_eks_cluster.this[0] will be created
  + resource "aws_eks_cluster" "this" {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + cluster_id                = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = [
          + "api",
          + "audit",
          + "authenticator",
        ]
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + name                      = "eks-staging"
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + tags_all                  = {
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + version                   = "1.28"

      + encryption_config {
          + resources = [
              + "secrets",
            ]

          + provider {
              + key_arn = (known after apply)
            }
        }

      + kubernetes_network_config {
          + ip_family         = (known after apply)
          + service_ipv4_cidr = (known after apply)
          + service_ipv6_cidr = (known after apply)
        }

      + timeouts {}

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = (known after apply)
          + subnet_ids                = [
              + "subnet-028272c89d907907e",
              + "subnet-09b2d330a203e78fb",
              + "subnet-0ef987da39abc9d14",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # aws_iam_openid_connect_provider.oidc_provider[0] will be created
  + resource "aws_iam_openid_connect_provider" "oidc_provider" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "Environment" = "staging"
          + "Name"        = "eks-staging-eks-irsa"
          + "Terraform"   = "true"
        }
      + tags_all        = {
          + "Environment" = "staging"
          + "Name"        = "eks-staging-eks-irsa"
          + "Terraform"   = "true"
        }
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # aws_iam_policy.cluster_encryption[0] will be created
  + resource "aws_iam_policy" "cluster_encryption" {
      + arn         = (known after apply)
      + description = "Cluster encryption policy to allow cluster role to utilize CMK provided"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "eks-staging-cluster-ClusterEncryption"
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = {
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + tags_all    = {
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
    }

  # aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                      + Sid       = "EKSClusterAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "eks-staging-cluster-"
      + path                  = "/"
      + tags                  = {
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + tags_all              = {
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = "eks-staging-cluster"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "logs:CreateLogGroup",
                            ]
                          + Effect   = "Deny"
                          + Resource = "*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
    }

  # aws_iam_role_policy_attachment.cluster_encryption[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_encryption" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = (known after apply)
    }

  # aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = (known after apply)
    }

  # aws_security_group.cluster[0] will be created
  + resource "aws_security_group" "cluster" {
      + arn                    = (known after apply)
      + description            = "EKS cluster security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "eks-staging-cluster-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "staging"
          + "Name"        = "eks-staging-cluster"
          + "Terraform"   = "true"
        }
      + tags_all               = {
          + "Environment" = "staging"
          + "Name"        = "eks-staging-cluster"
          + "Terraform"   = "true"
        }
      + vpc_id                 = "vpc-02a03faff519fa382"
    }

  # aws_security_group.node[0] will be created
  + resource "aws_security_group" "node" {
      + arn                    = (known after apply)
      + description            = "EKS node shared security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "eks-staging-node-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment"                       = "staging"
          + "Name"                              = "eks-staging-node"
          + "Terraform"                         = "true"
          + "kubernetes.io/cluster/eks-staging" = "owned"
        }
      + tags_all               = {
          + "Environment"                       = "staging"
          + "Name"                              = "eks-staging-node"
          + "Terraform"                         = "true"
          + "kubernetes.io/cluster/eks-staging" = "owned"
        }
      + vpc_id                 = "vpc-02a03faff519fa382"
    }

  # aws_security_group_rule.cluster["ingress_nodes_443"] will be created
  + resource "aws_security_group_rule" "cluster" {
      + description              = "Node groups to cluster API"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # aws_security_group_rule.node["egress_all"] will be created
  + resource "aws_security_group_rule" "node" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow all egress"
      + from_port                = 0
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # aws_security_group_rule.node["ingress_cluster_443"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node groups"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # aws_security_group_rule.node["ingress_cluster_4443_webhook"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node 4443/tcp webhook"
      + from_port                = 4443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 4443
      + type                     = "ingress"
    }

  # aws_security_group_rule.node["ingress_cluster_6443_webhook"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node 6443/tcp webhook"
      + from_port                = 6443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 6443
      + type                     = "ingress"
    }

  # aws_security_group_rule.node["ingress_cluster_8443_webhook"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node 8443/tcp webhook"
      + from_port                = 8443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8443
      + type                     = "ingress"
    }

  # aws_security_group_rule.node["ingress_cluster_9443_webhook"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node 9443/tcp webhook"
      + from_port                = 9443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 9443
      + type                     = "ingress"
    }

  # aws_security_group_rule.node["ingress_cluster_kubelet"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node kubelets"
      + from_port                = 10250
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 10250
      + type                     = "ingress"
    }

  # aws_security_group_rule.node["ingress_nodes_ephemeral"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node ingress on ephemeral ports"
      + from_port                = 1025
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # aws_security_group_rule.node["ingress_self_coredns_tcp"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS"
      + from_port                = 53
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "ingress"
    }

  # aws_security_group_rule.node["ingress_self_coredns_udp"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS UDP"
      + from_port                = 53
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "udp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "ingress"
    }

  # time_sleep.this[0] will be created
  + resource "time_sleep" "this" {
      + create_duration = "30s"
      + id              = (known after apply)
      + triggers        = {
          + "cluster_certificate_authority_data" = (known after apply)
          + "cluster_endpoint"                   = (known after apply)
          + "cluster_name"                       = "eks-staging"
          + "cluster_version"                    = "1.28"
        }
    }

  # module.eks_managed_node_group["general"].aws_eks_node_group.this[0] will be created
  + resource "aws_eks_node_group" "this" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = "eks-staging"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t2.micro",
        ]
      + node_group_name        = (known after apply)
      + node_group_name_prefix = "general-"
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-075985110aa9a2d0f",
          + "subnet-0cbac79f5cdac698d",
          + "subnet-0f3b3a0b79843026c",
        ]
      + tags                   = {
          + "Environment" = "staging"
          + "Name"        = "general"
          + "Terraform"   = "true"
        }
      + tags_all               = {
          + "Environment" = "staging"
          + "Name"        = "general"
          + "Terraform"   = "true"
        }
      + version                = "1.28"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + scaling_config {
          + desired_size = 2
          + max_size     = 4
          + min_size     = 1
        }

      + timeouts {}

      + update_config {
          + max_unavailable_percentage = 33
        }
    }

  # module.eks_managed_node_group["general"].aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EKSNodeAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "EKS managed node group IAM role"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "general-eks-node-group-"
      + path                  = "/"
      + tags                  = {
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + tags_all              = {
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + unique_id             = (known after apply)
    }

  # module.eks_managed_node_group["general"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = (known after apply)
    }

  # module.eks_managed_node_group["general"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = (known after apply)
    }

  # module.eks_managed_node_group["general"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = (known after apply)
    }

  # module.eks_managed_node_group["general"].aws_launch_template.this[0] will be created
  + resource "aws_launch_template" "this" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + description            = "Custom launch template for general EKS managed node group"
      + id                     = (known after apply)
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "general-"
      + tags                   = {
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + tags_all               = {
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + update_default_version = true
      + vpc_security_group_ids = (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = 2
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + monitoring {
          + enabled = true
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Environment" = "staging"
              + "Name"        = "general"
              + "Terraform"   = "true"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "Environment" = "staging"
              + "Name"        = "general"
              + "Terraform"   = "true"
            }
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "Environment" = "staging"
              + "Name"        = "general"
              + "Terraform"   = "true"
            }
        }
    }

  # module.kms.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
      + id                        = (known after apply)
      + json                      = (known after apply)
      + override_policy_documents = []
      + source_policy_documents   = []

      + statement {
          + actions   = [
              + "kms:CancelKeyDeletion",
              + "kms:Create*",
              + "kms:Delete*",
              + "kms:Describe*",
              + "kms:Disable*",
              + "kms:Enable*",
              + "kms:Get*",
              + "kms:List*",
              + "kms:Put*",
              + "kms:Revoke*",
              + "kms:ScheduleKeyDeletion",
              + "kms:TagResource",
              + "kms:UntagResource",
              + "kms:Update*",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "KeyAdministration"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::039454511521:user/rimvydas",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "kms:Decrypt",
              + "kms:DescribeKey",
              + "kms:Encrypt",
              + "kms:GenerateDataKey*",
              + "kms:ReEncrypt*",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "KeyUsage"

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # module.kms.aws_kms_alias.this["cluster"] will be created
  + resource "aws_kms_alias" "this" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/eks/eks-staging"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.kms.aws_kms_key.this[0] will be created
  + resource "aws_kms_key" "this" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "eks-staging cluster encryption key"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = false
      + policy                             = (known after apply)
      + tags                               = {
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + tags_all                           = {
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
    }

Plan: 35 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + aws_auth_configmap_yaml                          = (known after apply)
  + cloudwatch_log_group_arn                         = (known after apply)
  + cloudwatch_log_group_name                        = "/aws/eks/eks-staging/cluster"
  + cluster_addons                                   = {
      + coredns    = {
          + addon_name                  = "coredns"
          + addon_version               = (known after apply)
          + arn                         = (known after apply)
          + cluster_name                = "eks-staging"
          + configuration_values        = (known after apply)
          + created_at                  = (known after apply)
          + id                          = (known after apply)
          + modified_at                 = (known after apply)
          + preserve                    = null
          + resolve_conflicts           = "OVERWRITE"
          + resolve_conflicts_on_create = null
          + resolve_conflicts_on_update = null
          + service_account_role_arn    = null
          + tags                        = {
              + Environment = "staging"
              + Terraform   = "true"
            }
          + tags_all                    = {
              + Environment = "staging"
              + Terraform   = "true"
            }
          + timeouts                    = {
              + create = null
              + delete = null
              + update = null
            }
        }
      + kube-proxy = {
          + addon_name                  = "kube-proxy"
          + addon_version               = (known after apply)
          + arn                         = (known after apply)
          + cluster_name                = "eks-staging"
          + configuration_values        = (known after apply)
          + created_at                  = (known after apply)
          + id                          = (known after apply)
          + modified_at                 = (known after apply)
          + preserve                    = null
          + resolve_conflicts           = "OVERWRITE"
          + resolve_conflicts_on_create = null
          + resolve_conflicts_on_update = null
          + service_account_role_arn    = null
          + tags                        = {
              + Environment = "staging"
              + Terraform   = "true"
            }
          + tags_all                    = {
              + Environment = "staging"
              + Terraform   = "true"
            }
          + timeouts                    = {
              + create = null
              + delete = null
              + update = null
            }
        }
      + vpc-cni    = {
          + addon_name                  = "vpc-cni"
          + addon_version               = (known after apply)
          + arn                         = (known after apply)
          + cluster_name                = "eks-staging"
          + configuration_values        = (known after apply)
          + created_at                  = (known after apply)
          + id                          = (known after apply)
          + modified_at                 = (known after apply)
          + preserve                    = null
          + resolve_conflicts           = "OVERWRITE"
          + resolve_conflicts_on_create = null
          + resolve_conflicts_on_update = null
          + service_account_role_arn    = null
          + tags                        = {
              + Environment = "staging"
              + Terraform   = "true"
            }
          + tags_all                    = {
              + Environment = "staging"
              + Terraform   = "true"
            }
          + timeouts                    = {
              + create = null
              + delete = null
              + update = null
            }
        }
    }
  + cluster_arn                                      = (known after apply)
  + cluster_certificate_authority_data               = (known after apply)
  + cluster_endpoint                                 = (known after apply)
  + cluster_iam_role_arn                             = (known after apply)
  + cluster_iam_role_name                            = (known after apply)
  + cluster_iam_role_unique_id                       = (known after apply)
  + cluster_id                                       = (known after apply)
  + cluster_identity_providers                       = {}
  + cluster_name                                     = "eks-staging"
  + cluster_oidc_issuer_url                          = (known after apply)
  + cluster_platform_version                         = (known after apply)
  + cluster_primary_security_group_id                = (known after apply)
  + cluster_security_group_arn                       = (known after apply)
  + cluster_security_group_id                        = (known after apply)
  + cluster_status                                   = (known after apply)
  + cluster_tls_certificate_sha1_fingerprint         = (known after apply)
  + cluster_version                                  = "1.28"
  + eks_managed_node_groups                          = {
      + general = {
          + autoscaling_group_schedule_arns    = {}
          + iam_role_arn                       = (known after apply)
          + iam_role_name                      = (known after apply)
          + iam_role_unique_id                 = (known after apply)
          + launch_template_arn                = (known after apply)
          + launch_template_id                 = (known after apply)
          + launch_template_latest_version     = (known after apply)
          + launch_template_name               = (known after apply)
          + node_group_arn                     = (known after apply)
          + node_group_autoscaling_group_names = (known after apply)
          + node_group_id                      = (known after apply)
          + node_group_labels                  = null
          + node_group_resources               = (known after apply)
          + node_group_status                  = (known after apply)
          + node_group_taints                  = []
          + platform                           = "linux"
        }
    }
  + eks_managed_node_groups_autoscaling_group_names  = (known after apply)
  + fargate_profiles                                 = {}
  + kms_key_arn                                      = (known after apply)
  + kms_key_id                                       = (known after apply)
  + kms_key_policy                                   = (known after apply)
  + node_security_group_arn                          = (known after apply)
  + node_security_group_id                           = (known after apply)
  + oidc_provider                                    = (known after apply)
  + oidc_provider_arn                                = (known after apply)
  + self_managed_node_groups                         = {}
  + self_managed_node_groups_autoscaling_group_names = []
aws_cloudwatch_log_group.this[0]: Creating...
module.eks_managed_node_group["general"].aws_iam_role.this[0]: Creating...
aws_security_group.node[0]: Creating...
aws_iam_role.this[0]: Creating...
aws_security_group.cluster[0]: Creating...
module.eks_managed_node_group["general"].aws_iam_role.this[0]: Creation complete after 1s [id=general-eks-node-group-20231010122252969900000002]
module.eks_managed_node_group["general"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Creating...
module.eks_managed_node_group["general"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Creating...
module.eks_managed_node_group["general"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Creating...
aws_cloudwatch_log_group.this[0]: Creation complete after 1s [id=/aws/eks/eks-staging/cluster]
aws_iam_role.this[0]: Creation complete after 1s [id=eks-staging-cluster-20231010122252968700000001]
module.kms.data.aws_iam_policy_document.this[0]: Reading...
aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Creating...
aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Creating...
module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=3318154131]
module.eks_managed_node_group["general"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Creation complete after 0s [id=general-eks-node-group-20231010122252969900000002-20231010122253703900000005]
module.kms.aws_kms_key.this[0]: Creating...
module.eks_managed_node_group["general"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Creation complete after 0s [id=general-eks-node-group-20231010122252969900000002-20231010122253779600000006]
module.eks_managed_node_group["general"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Creation complete after 0s [id=general-eks-node-group-20231010122252969900000002-20231010122253825000000007]
aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Creation complete after 0s [id=eks-staging-cluster-20231010122252968700000001-20231010122253998600000008]
aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Creation complete after 0s [id=eks-staging-cluster-20231010122252968700000001-20231010122254001300000009]
aws_security_group.node[0]: Creation complete after 2s [id=sg-06030b690dc3cf699]
aws_security_group.cluster[0]: Creation complete after 2s [id=sg-00fcfc735f82157a5]
aws_security_group_rule.cluster["ingress_nodes_443"]: Creating...
aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Creating...
aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Creating...
aws_security_group_rule.node["ingress_nodes_ephemeral"]: Creating...
aws_security_group_rule.node["egress_all"]: Creating...
aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Creating...
aws_security_group_rule.node["ingress_cluster_kubelet"]: Creating...
aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Creating...
aws_security_group_rule.node["ingress_self_coredns_udp"]: Creating...
aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Creation complete after 1s [id=sgrule-1179484844]
aws_security_group_rule.node["ingress_cluster_443"]: Creating...
aws_security_group_rule.cluster["ingress_nodes_443"]: Creation complete after 1s [id=sgrule-647261123]
aws_security_group_rule.node["ingress_self_coredns_tcp"]: Creating...
aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Creation complete after 1s [id=sgrule-585937255]
aws_security_group_rule.node["ingress_nodes_ephemeral"]: Creation complete after 2s [id=sgrule-3091680380]
aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Creation complete after 3s [id=sgrule-1427226253]
aws_security_group_rule.node["egress_all"]: Creation complete after 3s [id=sgrule-4144928800]
aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Creation complete after 4s [id=sgrule-2622740763]
aws_security_group_rule.node["ingress_self_coredns_udp"]: Creation complete after 4s [id=sgrule-2695435125]
aws_security_group_rule.node["ingress_cluster_kubelet"]: Creation complete after 5s [id=sgrule-3610322247]
aws_security_group_rule.node["ingress_cluster_443"]: Creation complete after 5s [id=sgrule-4279920852]
aws_security_group_rule.node["ingress_self_coredns_tcp"]: Creation complete after 5s [id=sgrule-83275930]
module.kms.aws_kms_key.this[0]: Still creating... [10s elapsed]
module.kms.aws_kms_key.this[0]: Still creating... [20s elapsed]
module.kms.aws_kms_key.this[0]: Creation complete after 22s [id=4ae4b33a-e625-4432-bd8f-40d15d026488]
aws_iam_policy.cluster_encryption[0]: Creating...
module.kms.aws_kms_alias.this["cluster"]: Creating...
aws_eks_cluster.this[0]: Creating...
module.kms.aws_kms_alias.this["cluster"]: Creation complete after 1s [id=alias/eks/eks-staging]
aws_iam_policy.cluster_encryption[0]: Creation complete after 1s [id=arn:aws:iam::039454511521:policy/eks-staging-cluster-ClusterEncryption2023101012231641330000000a]
aws_iam_role_policy_attachment.cluster_encryption[0]: Creating...
aws_iam_role_policy_attachment.cluster_encryption[0]: Creation complete after 0s [id=eks-staging-cluster-20231010122252968700000001-2023101012231685260000000b]
aws_eks_cluster.this[0]: Still creating... [10s elapsed]
aws_eks_cluster.this[0]: Still creating... [20s elapsed]
aws_eks_cluster.this[0]: Still creating... [30s elapsed]
aws_eks_cluster.this[0]: Still creating... [40s elapsed]
aws_eks_cluster.this[0]: Still creating... [50s elapsed]
aws_eks_cluster.this[0]: Still creating... [1m0s elapsed]
aws_eks_cluster.this[0]: Still creating... [1m10s elapsed]
aws_eks_cluster.this[0]: Still creating... [1m20s elapsed]
aws_eks_cluster.this[0]: Still creating... [1m30s elapsed]
aws_eks_cluster.this[0]: Still creating... [1m40s elapsed]
aws_eks_cluster.this[0]: Still creating... [1m50s elapsed]
aws_eks_cluster.this[0]: Still creating... [2m0s elapsed]
aws_eks_cluster.this[0]: Still creating... [2m10s elapsed]
aws_eks_cluster.this[0]: Still creating... [2m20s elapsed]
aws_eks_cluster.this[0]: Still creating... [2m30s elapsed]
aws_eks_cluster.this[0]: Still creating... [2m40s elapsed]
aws_eks_cluster.this[0]: Still creating... [2m50s elapsed]
aws_eks_cluster.this[0]: Still creating... [3m0s elapsed]
aws_eks_cluster.this[0]: Still creating... [3m10s elapsed]
aws_eks_cluster.this[0]: Still creating... [3m20s elapsed]
aws_eks_cluster.this[0]: Still creating... [3m30s elapsed]
aws_eks_cluster.this[0]: Still creating... [3m40s elapsed]
aws_eks_cluster.this[0]: Still creating... [3m50s elapsed]
aws_eks_cluster.this[0]: Still creating... [4m0s elapsed]
aws_eks_cluster.this[0]: Still creating... [4m10s elapsed]
aws_eks_cluster.this[0]: Still creating... [4m20s elapsed]
aws_eks_cluster.this[0]: Still creating... [4m30s elapsed]
aws_eks_cluster.this[0]: Still creating... [4m40s elapsed]
aws_eks_cluster.this[0]: Still creating... [4m50s elapsed]
aws_eks_cluster.this[0]: Still creating... [5m0s elapsed]
aws_eks_cluster.this[0]: Still creating... [5m10s elapsed]
aws_eks_cluster.this[0]: Still creating... [5m20s elapsed]
aws_eks_cluster.this[0]: Still creating... [5m30s elapsed]
aws_eks_cluster.this[0]: Still creating... [5m40s elapsed]
aws_eks_cluster.this[0]: Still creating... [5m50s elapsed]
aws_eks_cluster.this[0]: Still creating... [6m0s elapsed]
aws_eks_cluster.this[0]: Still creating... [6m10s elapsed]
aws_eks_cluster.this[0]: Still creating... [6m20s elapsed]
aws_eks_cluster.this[0]: Still creating... [6m30s elapsed]
aws_eks_cluster.this[0]: Still creating... [6m40s elapsed]
aws_eks_cluster.this[0]: Still creating... [6m50s elapsed]
aws_eks_cluster.this[0]: Still creating... [7m0s elapsed]
aws_eks_cluster.this[0]: Still creating... [7m10s elapsed]
aws_eks_cluster.this[0]: Still creating... [7m20s elapsed]
aws_eks_cluster.this[0]: Still creating... [7m30s elapsed]
aws_eks_cluster.this[0]: Still creating... [7m40s elapsed]
aws_eks_cluster.this[0]: Still creating... [7m50s elapsed]
aws_eks_cluster.this[0]: Creation complete after 7m55s [id=eks-staging]
data.tls_certificate.this[0]: Reading...
data.aws_eks_addon_version.this["coredns"]: Reading...
time_sleep.this[0]: Creating...
data.aws_eks_addon_version.this["vpc-cni"]: Reading...
data.aws_eks_addon_version.this["kube-proxy"]: Reading...
aws_ec2_tag.cluster_primary_security_group["Terraform"]: Creating...
aws_ec2_tag.cluster_primary_security_group["Environment"]: Creating...
data.aws_eks_addon_version.this["coredns"]: Read complete after 0s [id=coredns]
data.aws_eks_addon_version.this["vpc-cni"]: Read complete after 0s [id=vpc-cni]
data.aws_eks_addon_version.this["kube-proxy"]: Read complete after 0s [id=kube-proxy]
data.tls_certificate.this[0]: Read complete after 0s [id=5933588ce34e24e9fb40c3565fb0b5993639df67]
aws_iam_openid_connect_provider.oidc_provider[0]: Creating...
aws_ec2_tag.cluster_primary_security_group["Environment"]: Creation complete after 0s [id=sg-00a98a4bbb01879a7,Environment]
aws_ec2_tag.cluster_primary_security_group["Terraform"]: Creation complete after 0s [id=sg-00a98a4bbb01879a7,Terraform]
aws_iam_openid_connect_provider.oidc_provider[0]: Creation complete after 0s [id=arn:aws:iam::039454511521:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/8AED6A08DAB2457C338B576A51CD266D]
time_sleep.this[0]: Still creating... [10s elapsed]
time_sleep.this[0]: Still creating... [20s elapsed]
time_sleep.this[0]: Still creating... [30s elapsed]
time_sleep.this[0]: Creation complete after 30s [id=2023-10-10T12:31:41Z]
module.eks_managed_node_group["general"].aws_launch_template.this[0]: Creating...
module.eks_managed_node_group["general"].aws_launch_template.this[0]: Creation complete after 0s [id=lt-0605c3223d27b442d]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Creating...
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still creating... [10s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still creating... [20s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still creating... [30s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still creating... [40s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still creating... [50s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still creating... [1m0s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still creating... [1m10s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still creating... [1m20s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still creating... [1m30s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still creating... [1m40s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still creating... [1m50s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still creating... [2m0s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still creating... [2m10s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still creating... [2m20s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Creation complete after 2m29s [id=eks-staging:general-2023101012314309990000000e]
aws_eks_addon.this["vpc-cni"]: Creating...
aws_eks_addon.this["kube-proxy"]: Creating...
aws_eks_addon.this["coredns"]: Creating...
aws_eks_addon.this["vpc-cni"]: Still creating... [10s elapsed]
aws_eks_addon.this["kube-proxy"]: Still creating... [10s elapsed]
aws_eks_addon.this["coredns"]: Still creating... [10s elapsed]
aws_eks_addon.this["vpc-cni"]: Still creating... [20s elapsed]
aws_eks_addon.this["kube-proxy"]: Still creating... [20s elapsed]
aws_eks_addon.this["coredns"]: Still creating... [20s elapsed]
aws_eks_addon.this["vpc-cni"]: Still creating... [30s elapsed]
aws_eks_addon.this["kube-proxy"]: Still creating... [30s elapsed]
aws_eks_addon.this["coredns"]: Still creating... [30s elapsed]
aws_eks_addon.this["kube-proxy"]: Creation complete after 35s [id=eks-staging:kube-proxy]
aws_eks_addon.this["vpc-cni"]: Creation complete after 36s [id=eks-staging:vpc-cni]
aws_eks_addon.this["coredns"]: Still creating... [40s elapsed]
aws_eks_addon.this["coredns"]: Creation complete after 46s [id=eks-staging:coredns]

Warning: Argument is deprecated

  with aws_eks_addon.this["vpc-cni"],
  on main.tf line 392, in resource "aws_eks_addon" "this":
 392:   resolve_conflicts        = try(each.value.resolve_conflicts, "OVERWRITE")

The "resolve_conflicts" attribute can't be set to "PRESERVE" on initial
resource creation. Use "resolve_conflicts_on_create" and/or
"resolve_conflicts_on_update" instead

(and 5 more similar warnings elsewhere)
Releasing state lock. This may take a few moments...

Apply complete! Resources: 35 added, 0 changed, 0 destroyed.

Outputs:

aws_auth_configmap_yaml = <<EOT
apiVersion: v1
kind: ConfigMap
metadata:
  name: aws-auth
  namespace: kube-system
data:
  mapRoles: |
    - rolearn: arn:aws:iam::039454511521:role/general-eks-node-group-20231010122252969900000002
      username: system:node:{{EC2PrivateDNSName}}
      groups:
        - system:bootstrappers
        - system:nodes

EOT
cloudwatch_log_group_arn = "arn:aws:logs:us-east-1:039454511521:log-group:/aws/eks/eks-staging/cluster"
cloudwatch_log_group_name = "/aws/eks/eks-staging/cluster"
cluster_addons = {
  "coredns" = {
    "addon_name" = "coredns"
    "addon_version" = "v1.10.1-eksbuild.4"
    "arn" = "arn:aws:eks:us-east-1:039454511521:addon/eks-staging/coredns/92c58cca-5194-9bec-7e18-f5b9b6df8fc3"
    "cluster_name" = "eks-staging"
    "configuration_values" = ""
    "created_at" = "2023-10-10T12:34:13Z"
    "id" = "eks-staging:coredns"
    "modified_at" = "2023-10-10T12:34:53Z"
    "preserve" = tobool(null)
    "resolve_conflicts" = "OVERWRITE"
    "resolve_conflicts_on_create" = tostring(null)
    "resolve_conflicts_on_update" = tostring(null)
    "service_account_role_arn" = ""
    "tags" = tomap({
      "Environment" = "staging"
      "Terraform" = "true"
    })
    "tags_all" = tomap({
      "Environment" = "staging"
      "Terraform" = "true"
    })
    "timeouts" = {
      "create" = tostring(null)
      "delete" = tostring(null)
      "update" = tostring(null)
    }
  }
  "kube-proxy" = {
    "addon_name" = "kube-proxy"
    "addon_version" = "v1.28.2-eksbuild.2"
    "arn" = "arn:aws:eks:us-east-1:039454511521:addon/eks-staging/kube-proxy/3cc58cca-5197-2352-1784-e5342e6023f8"
    "cluster_name" = "eks-staging"
    "configuration_values" = ""
    "created_at" = "2023-10-10T12:34:13Z"
    "id" = "eks-staging:kube-proxy"
    "modified_at" = "2023-10-10T12:34:46Z"
    "preserve" = tobool(null)
    "resolve_conflicts" = "OVERWRITE"
    "resolve_conflicts_on_create" = tostring(null)
    "resolve_conflicts_on_update" = tostring(null)
    "service_account_role_arn" = ""
    "tags" = tomap({
      "Environment" = "staging"
      "Terraform" = "true"
    })
    "tags_all" = tomap({
      "Environment" = "staging"
      "Terraform" = "true"
    })
    "timeouts" = {
      "create" = tostring(null)
      "delete" = tostring(null)
      "update" = tostring(null)
    }
  }
  "vpc-cni" = {
    "addon_name" = "vpc-cni"
    "addon_version" = "v1.15.0-eksbuild.2"
    "arn" = "arn:aws:eks:us-east-1:039454511521:addon/eks-staging/vpc-cni/e6c58cca-5193-6cbb-8ef0-60e98ccf5a90"
    "cluster_name" = "eks-staging"
    "configuration_values" = ""
    "created_at" = "2023-10-10T12:34:13Z"
    "id" = "eks-staging:vpc-cni"
    "modified_at" = "2023-10-10T12:34:47Z"
    "preserve" = tobool(null)
    "resolve_conflicts" = "OVERWRITE"
    "resolve_conflicts_on_create" = tostring(null)
    "resolve_conflicts_on_update" = tostring(null)
    "service_account_role_arn" = ""
    "tags" = tomap({
      "Environment" = "staging"
      "Terraform" = "true"
    })
    "tags_all" = tomap({
      "Environment" = "staging"
      "Terraform" = "true"
    })
    "timeouts" = {
      "create" = tostring(null)
      "delete" = tostring(null)
      "update" = tostring(null)
    }
  }
}
cluster_arn = "arn:aws:eks:us-east-1:039454511521:cluster/eks-staging"
cluster_certificate_authority_data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURCVENDQWUyZ0F3SUJBZ0lJQ2h0N2ZtallCUkF3RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TXpFd01UQXhNakl6TVRWYUZ3MHpNekV3TURjeE1qSTRNVFZhTUJVeApFekFSQmdOVkJBTVRDbXQxWW1WeWJtVjBaWE13Z2dFaU1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLCkFvSUJBUUN3MGxJUWtLam1nczMyTUZkdGJTWG1Rd1ZwakZDWUdzT2lJb1B0YithdDlUMnVHQjRYdUFUdVVwZTAKV3krM1p0MVZOSmhKSlo0SUlJT05sYi9iZTE1NGw5MW1ISm9pd0hqUllBSEw5bDdpM244TjFSREtOb3hSbUxMUQo1YWIxNEI2RkdZd1M3SzlWYmlxNDlGRTdyaVJoT2srMU9lME1pVWJyZXQxVmRVamFmQTVyZGU5RlBrNVJ0ZXdxCko4NVlwbHdQcjVtVExpYnpadW85WHgwNjlUYnpvT2hkRFI1K2U5VlM2RkNwU09ZQzVNQ3Rsb3RkSVBCOUFaa0sKNXlEcFB3SWlrZ2d4VHNmVFcrelUyVWQwTFRLRG9ET3V1a3dLRkpDOWNTVXM1V1o4L2tiNHI5YXNxMFMzRUpFMgpMaW52eUlHRDZCNlY2RnA1QUNVYnhSWXdIeWcxQWdNQkFBR2pXVEJYTUE0R0ExVWREd0VCL3dRRUF3SUNwREFQCkJnTlZIUk1CQWY4RUJUQURBUUgvTUIwR0ExVWREZ1FXQkJSSlFvdjgyNmN1MEZtSmhaUkhkSkRZOEJsQTlEQVYKQmdOVkhSRUVEakFNZ2dwcmRXSmxjbTVsZEdWek1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQUc2ZjQ5bE5jSApaZjFBbG9JMjhkbzhmbTVKVEllMnFiNVhqVXpMT0ExbVhtVEVGc1ExWmxKODNMTG5LdnArTzRMeFJpUzZMbzFkCmNNQnowVWlQSitiMWtzQWVIbSsrMElWb3RqbWFVSjlxaW83TkR1TENJK1NDaXY2RlVCckE3bVdkalBXU2ppVi8KaVlWQklMd3hVdU9OTlR4eDhpeHpMdTRkV2lIZHhQbVBiVnZXdFZGejlMWWF3bUVqU1JyVjd5eEVhNEtLS1o1OApRTUJQN1pma0UwNFI0MDNSNStpQ3h6WUdwTTJOakIxR09JcDl0eWRqbGRLR25oU3JQZWZiQTJnMm12bGVseXFRCkVtbVJqck9NVHJCMzljV01sWVl2dFFLcEdkVkxHdXd0VUdlcnBTVkxPa1llcjVUOEZtMDBKdFgwbndhNzVTaEoKc3JCazRpL3ZTMExZCi0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
cluster_endpoint = "https://8AED6A08DAB2457C338B576A51CD266D.gr7.us-east-1.eks.amazonaws.com"
cluster_iam_role_arn = "arn:aws:iam::039454511521:role/eks-staging-cluster-20231010122252968700000001"
cluster_iam_role_name = "eks-staging-cluster-20231010122252968700000001"
cluster_iam_role_unique_id = "AROAQSL5MCGQ63S6AQKY6"
cluster_identity_providers = {}
cluster_name = "eks-staging"
cluster_oidc_issuer_url = "https://oidc.eks.us-east-1.amazonaws.com/id/8AED6A08DAB2457C338B576A51CD266D"
cluster_platform_version = "eks.1"
cluster_primary_security_group_id = "sg-00a98a4bbb01879a7"
cluster_security_group_arn = "arn:aws:ec2:us-east-1:039454511521:security-group/sg-00fcfc735f82157a5"
cluster_security_group_id = "sg-00fcfc735f82157a5"
cluster_status = "ACTIVE"
cluster_tls_certificate_sha1_fingerprint = "9e99a48a9960b14926bb7f3b02e22da2b0ab7280"
cluster_version = "1.28"
eks_managed_node_groups = {
  "general" = {
    "autoscaling_group_schedule_arns" = {}
    "iam_role_arn" = "arn:aws:iam::039454511521:role/general-eks-node-group-20231010122252969900000002"
    "iam_role_name" = "general-eks-node-group-20231010122252969900000002"
    "iam_role_unique_id" = "AROAQSL5MCGQZ3CAKRYMG"
    "launch_template_arn" = "arn:aws:ec2:us-east-1:039454511521:launch-template/lt-0605c3223d27b442d"
    "launch_template_id" = "lt-0605c3223d27b442d"
    "launch_template_latest_version" = 1
    "launch_template_name" = "general-2023101012314273110000000c"
    "node_group_arn" = "arn:aws:eks:us-east-1:039454511521:nodegroup/eks-staging/general-2023101012314309990000000e/96c58cc9-2c25-bb44-4b68-28908f64a3a8"
    "node_group_autoscaling_group_names" = [
      "eks-general-2023101012314309990000000e-96c58cc9-2c25-bb44-4b68-28908f64a3a8",
    ]
    "node_group_id" = "eks-staging:general-2023101012314309990000000e"
    "node_group_labels" = tomap(null) /* of string */
    "node_group_resources" = tolist([
      {
        "autoscaling_groups" = tolist([
          {
            "name" = "eks-general-2023101012314309990000000e-96c58cc9-2c25-bb44-4b68-28908f64a3a8"
          },
        ])
        "remote_access_security_group_id" = ""
      },
    ])
    "node_group_status" = "ACTIVE"
    "node_group_taints" = toset([])
    "platform" = "linux"
  }
}
eks_managed_node_groups_autoscaling_group_names = tolist([
  "eks-general-2023101012314309990000000e-96c58cc9-2c25-bb44-4b68-28908f64a3a8",
])
fargate_profiles = {}
kms_key_arn = "arn:aws:kms:us-east-1:039454511521:key/4ae4b33a-e625-4432-bd8f-40d15d026488"
kms_key_id = "4ae4b33a-e625-4432-bd8f-40d15d026488"
kms_key_policy = "{\"Statement\":[{\"Action\":[\"kms:Update*\",\"kms:UntagResource\",\"kms:TagResource\",\"kms:ScheduleKeyDeletion\",\"kms:Revoke*\",\"kms:Put*\",\"kms:List*\",\"kms:Get*\",\"kms:Enable*\",\"kms:Disable*\",\"kms:Describe*\",\"kms:Delete*\",\"kms:Create*\",\"kms:CancelKeyDeletion\"],\"Effect\":\"Allow\",\"Principal\":{\"AWS\":\"arn:aws:iam::039454511521:user/rimvydas\"},\"Resource\":\"*\",\"Sid\":\"KeyAdministration\"},{\"Action\":[\"kms:ReEncrypt*\",\"kms:GenerateDataKey*\",\"kms:Encrypt\",\"kms:DescribeKey\",\"kms:Decrypt\"],\"Effect\":\"Allow\",\"Principal\":{\"AWS\":\"arn:aws:iam::039454511521:role/eks-staging-cluster-20231010122252968700000001\"},\"Resource\":\"*\",\"Sid\":\"KeyUsage\"}],\"Version\":\"2012-10-17\"}"
node_security_group_arn = "arn:aws:ec2:us-east-1:039454511521:security-group/sg-06030b690dc3cf699"
node_security_group_id = "sg-06030b690dc3cf699"
oidc_provider = "oidc.eks.us-east-1.amazonaws.com/id/8AED6A08DAB2457C338B576A51CD266D"
oidc_provider_arn = "arn:aws:iam::039454511521:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/8AED6A08DAB2457C338B576A51CD266D"
self_managed_node_groups = {}
self_managed_node_groups_autoscaling_group_names = tolist([])

  ```
</details>

<details><summary>Apply for <b>rimvydascivilis/app-infra#live_staging_vpc</b></summary>
  
```terraform
Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Using previously-installed hashicorp/aws v5.20.0

Terraform has been successfully initialized!
aws_vpc.this[0]: Refreshing state... [id=vpc-02a03faff519fa382]
aws_default_security_group.this[0]: Refreshing state... [id=sg-0dd57cc2c0d5c564e]
aws_subnet.private[0]: Refreshing state... [id=subnet-0f3b3a0b79843026c]
aws_default_route_table.default[0]: Refreshing state... [id=rtb-02dec8ba8180cdaaf]
aws_subnet.public[0]: Refreshing state... [id=subnet-01f526ebb2415f9c9]
aws_subnet.private[1]: Refreshing state... [id=subnet-0cbac79f5cdac698d]
aws_subnet.private[2]: Refreshing state... [id=subnet-075985110aa9a2d0f]
aws_default_network_acl.this[0]: Refreshing state... [id=acl-08d118187c1c54973]
aws_subnet.public[1]: Refreshing state... [id=subnet-0b65faec2d074212a]
aws_route_table.private[0]: Refreshing state... [id=rtb-09e0d9b0846d7982f]
aws_subnet.public[2]: Refreshing state... [id=subnet-03cd59b9f0f679048]
aws_route_table.intra[0]: Refreshing state... [id=rtb-06f35047538be894d]
aws_subnet.intra[0]: Refreshing state... [id=subnet-0ef987da39abc9d14]
aws_subnet.intra[2]: Refreshing state... [id=subnet-09b2d330a203e78fb]
aws_subnet.intra[1]: Refreshing state... [id=subnet-028272c89d907907e]
aws_internet_gateway.this[0]: Refreshing state... [id=igw-0ef05d06658abf6c1]
aws_route_table.public[0]: Refreshing state... [id=rtb-08462bc1a1f939651]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-085192e6b0e585192]
aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0793317483e167273]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0d37ae4fecc63d975]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0e7cac23638434d01]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0dc6be7913239b648]
aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-003ec8d6124888206]
aws_route_table_association.intra[2]: Refreshing state... [id=rtbassoc-070e5944dc244b1c1]
aws_route_table_association.intra[0]: Refreshing state... [id=rtbassoc-0d72555520dfd6903]
aws_route_table_association.intra[1]: Refreshing state... [id=rtbassoc-0561cf1cd7aaa85f4]
aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-08462bc1a1f9396511080289494]
aws_eip.nat[0]: Refreshing state... [id=eipalloc-0413a31dd5cbf860c]
aws_nat_gateway.this[0]: Refreshing state... [id=nat-0ecf69b9d558b5773]
aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-09e0d9b0846d7982f1080289494]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
Releasing state lock. This may take a few moments...

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.

Outputs:

azs = tolist([
  "us-east-1a",
  "us-east-1b",
  "us-east-1c",
])
cgw_arns = []
cgw_ids = []
database_nat_gateway_route_ids = []
database_route_table_association_ids = []
database_route_table_ids = tolist([
  "rtb-09e0d9b0846d7982f",
])
database_subnet_arns = []
database_subnets = []
database_subnets_cidr_blocks = tolist([])
database_subnets_ipv6_cidr_blocks = tolist([])
default_network_acl_id = "acl-08d118187c1c54973"
default_route_table_id = "rtb-02dec8ba8180cdaaf"
default_security_group_id = "sg-0dd57cc2c0d5c564e"
elasticache_route_table_association_ids = []
elasticache_route_table_ids = [
  "rtb-09e0d9b0846d7982f",
]
elasticache_subnet_arns = []
elasticache_subnets = []
elasticache_subnets_cidr_blocks = tolist([])
elasticache_subnets_ipv6_cidr_blocks = tolist([])
igw_arn = "arn:aws:ec2:us-east-1:039454511521:internet-gateway/igw-0ef05d06658abf6c1"
igw_id = "igw-0ef05d06658abf6c1"
intra_route_table_association_ids = [
  "rtbassoc-0d72555520dfd6903",
  "rtbassoc-0561cf1cd7aaa85f4",
  "rtbassoc-070e5944dc244b1c1",
]
intra_route_table_ids = [
  "rtb-06f35047538be894d",
]
intra_subnet_arns = [
  "arn:aws:ec2:us-east-1:039454511521:subnet/subnet-0ef987da39abc9d14",
  "arn:aws:ec2:us-east-1:039454511521:subnet/subnet-028272c89d907907e",
  "arn:aws:ec2:us-east-1:039454511521:subnet/subnet-09b2d330a203e78fb",
]
intra_subnets = [
  "subnet-0ef987da39abc9d14",
  "subnet-028272c89d907907e",
  "subnet-09b2d330a203e78fb",
]
intra_subnets_cidr_blocks = tolist([
  "10.0.6.0/24",
  "10.0.7.0/24",
  "10.0.8.0/24",
])
intra_subnets_ipv6_cidr_blocks = tolist([])
name = "vpc-staging"
nat_ids = [
  "eipalloc-0413a31dd5cbf860c",
]
nat_public_ips = tolist([
  "35.170.124.248",
])
natgw_ids = [
  "nat-0ecf69b9d558b5773",
]
outpost_subnet_arns = []
outpost_subnets = []
outpost_subnets_cidr_blocks = tolist([])
outpost_subnets_ipv6_cidr_blocks = tolist([])
private_ipv6_egress_route_ids = []
private_nat_gateway_route_ids = [
  "r-rtb-09e0d9b0846d7982f1080289494",
]
private_route_table_association_ids = [
  "rtbassoc-0d37ae4fecc63d975",
  "rtbassoc-085192e6b0e585192",
  "rtbassoc-0793317483e167273",
]
private_route_table_ids = [
  "rtb-09e0d9b0846d7982f",
]
private_subnet_arns = [
  "arn:aws:ec2:us-east-1:039454511521:subnet/subnet-0f3b3a0b79843026c",
  "arn:aws:ec2:us-east-1:039454511521:subnet/subnet-0cbac79f5cdac698d",
  "arn:aws:ec2:us-east-1:039454511521:subnet/subnet-075985110aa9a2d0f",
]
private_subnets = [
  "subnet-0f3b3a0b79843026c",
  "subnet-0cbac79f5cdac698d",
  "subnet-075985110aa9a2d0f",
]
private_subnets_cidr_blocks = tolist([
  "10.0.0.0/24",
  "10.0.1.0/24",
  "10.0.2.0/24",
])
private_subnets_ipv6_cidr_blocks = tolist([])
public_internet_gateway_route_id = "r-rtb-08462bc1a1f9396511080289494"
public_route_table_association_ids = [
  "rtbassoc-0e7cac23638434d01",
  "rtbassoc-0dc6be7913239b648",
  "rtbassoc-003ec8d6124888206",
]
public_route_table_ids = [
  "rtb-08462bc1a1f939651",
]
public_subnet_arns = [
  "arn:aws:ec2:us-east-1:039454511521:subnet/subnet-01f526ebb2415f9c9",
  "arn:aws:ec2:us-east-1:039454511521:subnet/subnet-0b65faec2d074212a",
  "arn:aws:ec2:us-east-1:039454511521:subnet/subnet-03cd59b9f0f679048",
]
public_subnets = [
  "subnet-01f526ebb2415f9c9",
  "subnet-0b65faec2d074212a",
  "subnet-03cd59b9f0f679048",
]
public_subnets_cidr_blocks = tolist([
  "10.0.3.0/24",
  "10.0.4.0/24",
  "10.0.5.0/24",
])
public_subnets_ipv6_cidr_blocks = tolist([])
redshift_public_route_table_association_ids = []
redshift_route_table_association_ids = []
redshift_route_table_ids = tolist([
  "rtb-09e0d9b0846d7982f",
])
redshift_subnet_arns = []
redshift_subnets = []
redshift_subnets_cidr_blocks = tolist([])
redshift_subnets_ipv6_cidr_blocks = tolist([])
this_customer_gateway = {}
vpc_arn = "arn:aws:ec2:us-east-1:039454511521:vpc/vpc-02a03faff519fa382"
vpc_cidr_block = "10.0.0.0/16"
vpc_enable_dns_hostnames = true
vpc_enable_dns_support = true
vpc_flow_log_cloudwatch_iam_role_arn = ""
vpc_flow_log_destination_arn = ""
vpc_flow_log_destination_type = "cloud-watch-logs"
vpc_id = "vpc-02a03faff519fa382"
vpc_instance_tenancy = "default"
vpc_ipv6_association_id = ""
vpc_ipv6_cidr_block = ""
vpc_main_route_table_id = "rtb-02dec8ba8180cdaaf"
vpc_owner_id = "039454511521"
vpc_secondary_cidr_blocks = tolist([])

  ```
</details>

</details>